[
  {
    "name": "Hassan Kamran Bashir",
    "title": "Managing Partner",
    "bio": "A distinguished Advocate of the Supreme Court of Pakistan, esteemed for his exceptional expertise in taxation, international law, and corporate affairs. With a Master of Laws (LL.M) degree from the prestigious Harvard Law School, where he was a World Bank scholar, Mr. Bashir brings a wealth of knowledge and experience to his practice. His training as a commissioned officer of 23rd Common Training Program and extensive background in tax law, garnered from over 13 years of service with the Federal Board of Revenue, enables him to provide expert counsel to clients on complex tax matters, international trade laws, and corporate legal issues.",
    "fullBio": "He is also an adjunct faculty member at esteemed educational institutions of Lahore where he teaches Public International Law and Taxation to graduate level students pursuing external degree programs affiliated with various European universities. As a visionary and researcher, he has assisted planning and development sector and other policy making institutions. In 2015 and 2016 he worked with the Food and Agriculture Organization team for drafting Federal and Provincial laws. He was also the World Bank's consultant regarding the Punjab Revenue Authority Tax Litigation book in 2016-2017, and a resource person for the 'Contract Enforcement' workshop for CAREC (a regional organization of 11 countries) held in Urumqi, China in July 2018. He serves as Deputy Convenor of the Federation of Pakistan Chambers of Commerce & Industry (FPCCI) Legal Affairs Committee.",
    "image": "/assets/people/hassan-kamran-bashir.svg",
    "profileUrl": null
  },
  {
    "name": "CH. Muhammad Ali",
    "title": "Advocate Supreme Court",
    "bio": "Leads the firm's criminal and civil practice. With over 23 years of experience, he has developed expertise in handling complex cases before Trial Courts, Tribunals, High Courts, and the Supreme Court. A protégé of renowned lawyer Mr. Munir Bhatti, Mr. Ali's extensive experience is complemented by his academic background, holding a Master's degree in Political Science from Government College Lahore and LL.B from University Law College, Lahore.",
    "fullBio": "Mr. Ali and his team are dedicated to delivering exceptional client service, ensuring meticulous due diligence, and pursuing matters with professionalism and integrity. With an academic foundation from the University Law College, Lahore, he brings a practical, courtroom-oriented approach to both criminal and civil matters, and regularly represents clients in major trials and appellate hearings.",
    "image": "/assets/people/muhammad-ali.svg",
    "profileUrl": null
  },
  {
    "name": "Nasrminallah Mian",
    "title": "Advocate High Court",
    "bio": "Started with the Public sector as an Inland Revenue Service (IRS) officer with the 23rd Common Training Program and now has a diverse and well-rounded experience portfolio of about 25 years that includes operational experience in the Federal Government, transnational ICT corporate and a leading international financial institution in various leading roles. He received his LL.B from SM Law College, Karachi University. He also has a Master's degree in Management from ANU, Australia and a Master's degree in Chemistry from Pakistan.",
    "fullBio": "Nasr began his career in the public sector as an Inland Revenue Service (IRS) officer under the 23rd Common Training Program, and he brings about 25 years of combined operational and regulatory experience. His background spans assignments with the Federal Government, transnational ICT corporations, and a leading international financial institution in senior roles. He holds an LL.B from SM Law College, Karachi, a Master's in Management from ANU, Australia, and a Master's in Chemistry. Nasr takes a keen interest in governance and ICT policy linkages, enjoys strong collaborative networks, and contributes time to voluntary service. (Note: Nasr is currently on leave from the firm.)",
    "image": "/assets/people/nasrminallah-mian.svg",
    "profileUrl": null
  }
]
